#                                           Intro to pandas:

Importing the pandas library and matplotlib. Pandas are basically called as PYTHON DATA ANALYSIS Library. Used in cleaning and processing the data in AI fields.

In [1]:
import pandas as pd
import matplotlib.pyplot
%matplotlib inline

In [2]:
exm_data = {
    'name' : ['kelly','ami','pal','raj','grecee','sowmi','rani','raj','visa','rathi'],
    'score' : [45,67,89,34,56,44,37,78,90,50],
    'attempt' : [1,2,3,2,1,4,2,4,3,1]
}
lables = ['a','b','c','d','e','f','g','h','i','j']
Df = pd.DataFrame(exm_data,index=lables)
Df

     name  score  attempt
a   kelly     45        1
b     ami     67        2
c     pal     89        3
d     raj     34        2
e  grecee     56        1
f   sowmi     44        4
g    rani     37        2
h     raj     78        4
i    visa     90        3
j   rathi     50        1

**Sample of DataFrame how it works. Will be resulting in the relational database(like rows and coloumns)**

### Flitring a particular coloumn

In [3]:
Df['score']

a    45
b    67
c    89
d    34
e    56
f    44
g    37
h    78
i    90
j    50
Name: score, dtype: int64

### Flitring a particular cell

In [11]:
Df[Df['name']=='visa'] ['score']

i    90
Name: score, dtype: int64

### Flitring a particular row

In [35]:
Df[Df['name']=='visa']

   name  score  attempt
i  visa     90        3

**Checking the datas which return the boolean values and can be check a particular cell**

In [44]:
Df['name']=='visa'

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
i     True
j    False
Name: name, dtype: bool

### Editng a particular cell value

In [46]:
Df.loc['e','score']=90
Df

     name  score  attempt
a   kelly     45        1
b     ami     67        2
c     pal     89        3
d     raj     34        2
e  grecee     90        1
f   sowmi     44        4
g    rani     37        2
h     raj     78        4
i    visa     90        3
j   rathi     50        1

### Logical flitering

In [50]:
Df[(Df['score']>=50)&(Df['score']<=90)]

     name  score  attempt
b     ami     67        2
c     pal     89        3
e  grecee     90        1
h     raj     78        4
i    visa     90        3
j   rathi     50        1

### Arithmetic on columns

In [56]:
A = Df['score'].mean()
B = Df['attempt'].sum()
A,B

(62.4, 23)

### Basic functions in pandas

In [61]:
#Defaultly takes first 5 elements can also pass the arguments
Df.head()

     name  score  attempt
a   kelly     45        1
b     ami     67        2
c     pal     89        3
d     raj     34        2
e  grecee     90        1

In [70]:
#finds the location of the integer and returns the data.
Df.iloc[3]

name       raj
score       34
attempt      2
Name: d, dtype: object

In [71]:
#Can also do sclicing
Df.iloc[:3]

    name  score  attempt
a  kelly     45        1
b    ami     67        2
c    pal     89        3

Pandas support four types of Multi-axes indexing they are:

Dataframe.[ ] : This function also known as indexing operator.
Dataframe.loc[ ] : This function is used for labels.
Dataframe.iloc[ ] : This function is used for positions or integer based.
Dataframe.ix[] : This function is used for both label and integer based.